// what is pure function 
// * it returns the same result if given the same arguments
// * it does not cause any observable side effects
// একটি পিওর ফাংশন (Pure Function) হলো এমন একটি ফাংশন যা নির্দিষ্ট ইনপুটের জন্য সর্বদা একই আউটপুট প্রদান 
// করে এবং এর এক্সিকিউশন প্রক্রিয়ায় কোনো সাইড এফেক্ট তৈরি করে না। পিওর ফাংশন প্রোগ্রামিংয়ে খুবই গুরুত্বপূর্ণ, 
// বিশেষ করে ফাংশনাল প্রোগ্রামিং এপ্রোচে।

// পিওর ফাংশনের বৈশিষ্ট্য:
// নির্ধারিত আউটপুট: পিওর ফাংশন একই ইনপুটের জন্য সর্বদা একই আউটপুট প্রদান করে।
// সাইড এফেক্ট নেই: পিওর ফাংশন তার এক্সিকিউশন প্রক্রিয়ায় কোনো সাইড এফেক্ট তৈরি করে না। অর্থাৎ, এটি ইনপুট 
// প্যারামিটারগুলো ছাড়া অন্য কোনো ভ্যারিয়েবল বা স্টেট পরিবর্তন করে না।
// উদাহরণ:
// পিওর ফাংশনের উদাহরণ:
function add(n){
    return n*n
}
console.log(add(3));

// উপরের add ফাংশনটি একটি পিওর ফাংশন কারণ এটি নির্দিষ্ট ইনপুটের জন্য সর্বদা একই আউটপুট প্রদান করে এবং এর
//  এক্সিকিউশন প্রক্রিয়ায় কোনো সাইড এফেক্ট তৈরি হয় না।
//that is not pure function besouce 
// var n = 10 
// function changs (){
//     n = 100
// }
// changs()
// console.log(n);

// var point =
// {
//     x:100,
//     y: 200,
// }
   


// function toPoint(point){
// point.x = 1000,
// point.y = 2000
// console.log(point);
// }
// toPoint()
// console.log(point);


// পিওর ফাংশনের উপকারিতা:
// সহজে বোধগম্য: পিওর ফাংশন সহজেই বোঝা যায় কারণ এটি নির্দিষ্ট ইনপুটের জন্য নির্দিষ্ট আউটপুট প্রদান করে।
// সহজে টেস্ট করা যায়: পিওর ফাংশনগুলো টেস্ট করা সহজ কারণ এর কোনো বাহ্যিক ডিপেন্ডেন্সি নেই এবং নির্দিষ্ট ইনপুটের জন্য একই আউটপুট দেয়।
// রিফ্যাক্টরিং করা সহজ: পিওর ফাংশন কোড পরিবর্তনের সময় ভুল হওয়ার সম্ভাবনা কম থাকে কারণ এটি বাহ্যিক স্টেটের উপর নির্ভর করে না।
// সমান্তরাল এক্সিকিউশন সহজ: পিওর ফাংশনগুলো সমান্তরালভাবে চালানো সহজ কারণ এগুলো কোনো শেয়ারড স্টেট পরিবর্তন করে না।


// prcticer 

function equal(n,x){
sum = n+x
return sum
}

console.log(equal(3,3));